app/controllers/interests_controller.rb

  def create
    @user = User.find(params[:user_id])
    @interest = Interest.find_or_create_by_name(params[:interest][:name])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "3"]]
INSERT INTO "interests" ("category_id", "name", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["category_id", nil], ["name", "Things"], ["user_id", 3]]