app/controllers/sessions_controller.rb

INSERT INTO "users" ("city", "created_at", "description", "email", "image", "latitude", "longitude", "name", "oauth_expires_at", "oauth_token", "provider", "state", "street", "tagline", "uid", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
UPDATE "users" SET "oauth_token" = 'CAAGuKRn7gUgBADU1NciQYhtSWRSyYU9ZB7vrHnAhZB8vIZCOMKRRguMrPLlkktUNNm6D1MogxmC0SKhEz4tXzMfQa5XMdAsy3BnXmb0DTLBqciUVXCKZC94Rmpkvl3yzsrxoEJ9xNZBmnrhMCUUqQsWYY8eVlAzLXaAI4JPmxMIQD3ARqrMlBT6gDKZCWgp9gZD', "updated_at" = '2014-05-02 01:06:56.071557' WHERE "users"."id" = 1
---
  def create
    user = User.from_omniauth(env['omniauth.auth'])
    result = request.location

    if user.latitude == nil && user.longitude == nil
      user.latitude = result.data['latitude']
      user.longitude = result.data['longitude']
      user.save