app/controllers/skills_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "3"]]
INSERT INTO "skills" ("category_id", "name", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["category_id", 4], ["name", "POttery"], ["user_id", 3]]
---
  def create
    @user = User.find(params[:user_id])
    @skill = @user.skills.build(params[:skill])
    if @skill.save