app/controllers/users_controller.rb

  def index
    render :welcome, layout: false unless signed_in?
    @categories = Category.all
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user       = User.find(params[:id])
    @skill      = Skill.new
    @interest   = Interest.new
    @categories = Category.all.collect { |m| [m.name, m.id] }.sort
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "tagline" = 'new tagline', "updated_at" = '2014-05-02 04:11:19.835427' WHERE "users"."id" = 1